#Просим пользователя ввести количество школьников
n = int(input("Введите количество школьников: "))
#Просим пользователя ввести количество яблок
k = int(input("Введите количество яблок: "))
#Количество яблок на каждого школьника
apples_for_student = k // n 
#Количество яблок, которые остануться в корзине
remaining_apples = k % n
#Вывод количества яблок на каждого школьника
print(f"Каждому школьнику достанется {apples_for_student} яблок(а).")
#Вывод количества яблок, которые остануться в корзине
print(f"В корзинке останется {remaining_apples} яблок(а).")
